posts.org
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: posts
* Branchless Partitioning with Hoare & Lomuto
  :PROPERTIES:
  :EXPORT_FILE_NAME: branchless-partitioning
  :EXPORT_DATE: 2025-07-27
  :EXPORT_HUGO_DRAFT: true
  :END:

I had an opportunity to implement the quickselect algorithm recently. It was a good refresher of.

Paritioning is one of the steps

** Naive

One of the naive solutions might to pick a pivot, and iterate through it to construct a `[left]` and `[right]` list.
Then assign this concatenated list back to the original list variable. Surely there's a better in place solution than:

#+BEGIN_SRC python
  pivot_value = 5
  left = []
  right = []
  for i in range(arr):
      if i <= pivot_value:
          left += [i]
      else:
          right += [i]
  arr = left + right
#+END_SRC

** Hoare

When quick sorting



